new diagrams
